<a href="https://colab.research.google.com/github/jiriyaporn/data_viz/blob/main/12314.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [4]:
data1 = pd.read_excel('01 คะแนนสอบวิชาคณิตศาสตร์.xlsx')
data1.head()

  คะแนนสอบวิชาคณิตศาสตร์          Unnamed: 1  ...  Unnamed: 7    Unnamed: 8
0                    NaN                 NaN  ...         NaN           NaN
1                    NaN  คะแนนสอบครั้งที่ 1  ...  เกรด (S,U)  เกรด (G,P,U)
2                 นายเมฆ                  22  ...         NaN           NaN
3                นายหมอก                  24  ...         NaN           NaN
4               นางสาวฝน                  12  ...         NaN           NaN

[5 rows x 9 columns]

In [73]:
df = pd.read_csv('Data_Facebook1_R.csv')
df

      No  GENDER  AGE  EDUCATION  CAREER  SALARY  ...  F3  F4  F5  O1  O2  O3
0      1       1   23          3       3   20000  ...   3   3   5   5   4   1
1      2       1   22          3       2   16000  ...   3   3   5   5   5   2
2      3       0   25          3       3   18000  ...   1   2   4   5   3   1
3      4       1   21          2       2   14000  ...   5   4   5   5   5   3
4      5       0   18          2       1   10000  ...   4   4   5   5   5   3
..   ...     ...  ...        ...     ...     ...  ...  ..  ..  ..  ..  ..  ..
195  196       0   25          3       3   20000  ...   4   3   5   5   4   4
196  197       1   24          3       3   18000  ...   4   1   5   5   5   4
197  198       0   17          2       1   10000  ...   4   4   5   5   5   4
198  199       0   25          3       3   20000  ...   3   4   5   5   5   5
199  200       1   25          3       3   20000  ...   3   3   5   5   3   1

[200 rows x 21 columns]

In [75]:
s = df[['AGE', 'SALARY','INTERNET_PAY']]
s

     AGE  SALARY  INTERNET_PAY
0     23   20000           590
1     22   16000           500
2     25   18000           590
3     21   14000           500
4     18   10000           650
..   ...     ...           ...
195   25   20000           590
196   24   18000           500
197   17   10000           590
198   25   20000           650
199   25   20000           590

[200 rows x 3 columns]

In [83]:
type(s)

pandas.core.frame.DataFrame

In [91]:
s.columns

Index(['AGE', 'SALARY', 'INTERNET_PAY'], dtype='object')

In [77]:

data2 = data1[['คะแนนสอบวิชาคณิตศาสตร์', 'Unnamed: 1',	'Unnamed: 2',	'Unnamed: 3',	'Unnamed: 4']]
data2

   คะแนนสอบวิชาคณิตศาสตร์  ...          Unnamed: 4
0                     NaN  ...                 NaN
1                     NaN  ...  คะแนนสอบครั้งที่ 4
2                  นายเมฆ  ...                  19
3                 นายหมอก  ...                  22
4                นางสาวฝน  ...                  10
5               นางสาวฟ้า  ...                  19
6                     NaN  ...                 NaN
7                     max  ...                 NaN
8                     min  ...                 NaN
9                    mean  ...                 NaN
10                   mode  ...                 NaN
11                 median  ...                 NaN
12               variance  ...                 NaN
13     standard deviation  ...                 NaN

[14 rows x 5 columns]

In [14]:
data3 = data2.iloc[1:6,:]
data4 = data3.drop(1)
data4

  คะแนนสอบวิชาคณิตศาสตร์ Unnamed: 1 Unnamed: 2 Unnamed: 3 Unnamed: 4
2                 นายเมฆ         22         20         14         19
3                นายหมอก         24         23         20         22
4               นางสาวฝน         12         10         16         10
5              นางสาวฟ้า         14         17         15         19

In [144]:
a = data4
a

  คะแนนสอบวิชาคณิตศาสตร์ Unnamed: 1 Unnamed: 2 Unnamed: 3 Unnamed: 4
2                 นายเมฆ         22         20         14         19
3                นายหมอก         24         23         20         22
4               นางสาวฝน         12         10         16         10
5              นางสาวฟ้า         14         17         15         19

In [132]:
import numpy as np

In [173]:
a1 = a.iloc[0,1], a.iloc[0,2], a.iloc[0,3], a.iloc[0,4]
a1

(22, 20, 14, 19)

In [174]:
a2 = a.iloc[1,1], a.iloc[1,2], a.iloc[1,3], a.iloc[1,4]
a2

(24, 23, 20, 22)

In [167]:
def a1(score) :
  st = score.split( ' , ' )
  
  ab = int(st[0])
  ac = int(st[1])
  ad = int(st[2])
  ae = int(st[3])
  sum = ab+ac+ad+ae
  ass = f' ผลรวม {sum}'
  print(ass)

In [175]:
list_a = ['22, 20, 14, 19', '24, 23, 20, 22']

In [177]:

for i in list_a :
  a1(i)

TypeError: ignored